{"attributes":{"description":"This page provides some basic information about using the Kibana dashboards.  It includes information about how to work with filters to subset your data based on a particular field and how search for messages containing specific text. (Expand this panel for more information)","kibanaSavedObjectMeta":{"searchSourceJSON":"{\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filter\":[]}"},"title":"Quick Introduction to Using Kibana Dashboards","uiStateJSON":"{}","version":1,"visState":"{\"title\":\"Quick Introduction to Using Kibana Dashboards\",\"type\":\"markdown\",\"params\":{\"fontSize\":12,\"openLinksInNewTab\":true,\"markdown\":\"## Maximizing and Minimizing a Panel\\n\\nTo change the size of a panel on the dashboard, click the three dots in the upper right corner of the panel and select ***Full screen*** or ***Minimize***.\\n\\n## Filtering\\nFiltering enables you to subset the log messages displayed based on the value of a field.\\n \\nTo define a filter, select ***+Add Filter*** at the top of the dashboard. You can select a field on which to filter, select an operator (whether to include or exclude specified values), and specify the values to use for the filter. Although the filter value dialog supports auto-completion, response time can be slow, and results are sometimes incomplete if there are many possible values. Click ***Save*** to close the dialog and apply the filter.\\n \\nAfter you apply a filter, a breadcrumb appears at the top of the page that contains the filter criteria. Click on the breadcrumb text to display these filter options:\\n* ***Edit Filter***- Display filter dialog so that you can edit the filter definition\\n* ***Include|Exclude Results***- Toggle between displaying only results that match the filter and displaying everything except results that match the filter.\\n* ***Temporary Disable|Re-enable***- Toggle between disabling and enabling the filter. A disabled filter remains available and is displayed with strike-through text.\\n* ***Delete***- Discard this filter. The filter is no longer available and must be recreated to be used again.\\n\\n## Searching\\nSearching enables you to locate specific information about log messages.  \\n\\nTo search, type a search query in the ***Search*** field at the top of the dashboard to find log messages matching the query.  \\n\\nBy default, Kibana searches all the fields in the index for the specified search terms and displays only messages containing the search terms.  \\n\\nTo limit the search to a specific field, use this format for the search query:  **<field_name>:”<search_terms>”**  \\nNote that the search terms must be enclosed in quotation marks.  \\n\\nFor example, to search the message field for the words “fatal error”, use the search query\\n***message:”fatal error”***\\n \\nRefer to the [Kibana documentation](https://www.elastic.co/guide/en/kibana/7.6/search.html) for more information about searching and using the Kibana Query Language (KQL).\"},\"aggs\":[]}"},"id":"7e09b630-3c09-11eb-b2f6-2f9d5c7b79d9","migrationVersion":{"visualization":"7.4.2"},"references":[],"type":"visualization","updated_at":"2021-10-13T13:49:56.482Z","version":"WzI3MCw5XQ=="}
{"exportedCount":1,"missingRefCount":0,"missingReferences":[]}